<!DOCTYPE html>
<head>
<meta charset="UTF-8" /><title>PureWeb Blog-【Win Pwn】Windows内核池笔记</title><link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/styles/default.min.css" /><script src="https://cdnjs.cloudflare.com/ajax/libs/highlight.js/11.8.0/highlight.min.js"></script>  <script>    document.querySelectorAll('code').forEach((code) => {      if (!code.classList.length) {        code.classList.add('language-bash');      }    });  </script>	<script>		document.addEventListener('DOMContentLoaded', (event) => {			hljs.highlightAll();		});	</script><link rel="stylesheet" href="/TestRepo/github.css">
<link rel="stylesheet" href="/TestRepo/speciou.css"
</head><body><div class="container"><header class="main-header"><h1 class="main-header__title uplize"><a class="main-header__title__link" href="/TestRepo/">Joe1sn's Cabinet</a></h1><nav class="main-header__nav"><ul class="main-nav"><li class="main-nav__list"><a class="main-nav__list__link active" href="TestRepo/" target="_self">HOME</a></li><li class="main-nav__list"><a class="main-nav__list__link" href="/TestRepo/archives/"target="_self">ARCHIVE</a></li><li class="main-nav__list"><a class="main-nav__list__link" href="https://github.com/Joe1sn"target="_blank">GITHUB</a></li></ul></nav></header></div><div id="write" class>
<div id="write" class>
<div class="typora-export os-windows"><div id="write" class>
<p><strong>2024-03-17 09:43:37</strong></p>
<p>文章来自blackhat 2021的文章《Windows-Heap-Backed-Pool-The-Good-The-Bad-And-The-Encoded》</p>
<p>原文链接：https://i.blackhat.com/USA21/Wednesday-Handouts/us-21-Windows-Heap-Backed-Pool-The-Good-The-Bad-And-The-Encoded.pdf</p>
<p>Youtube：https://www.youtube.com/watch?v=VvxNc8GTFfk</p>
<!--more-->
<h1>粗略的分配</h1>
<p>内核动态内存：和R3中的对差不多</p>
<p>类型为可分页和不可分页，程序按照4KB分页，之前写过一点相关的：<a href="https://joe1sn.eu.org/2023/02/17/windows_kernel_driver_2/">Joe1sn's Cabinet | windows内核驱动 2-页表探索</a></p>
<p>旧API初始化中不会将内存置零，导致信息泄露</p>
<p>一些API</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/f1d91b71f507bed8db8d8849de7e6bff.png" alt="image-20240317095459904" /></p>
<p>在RS5（Redstone 5）版本前（及Windows 1809，在2018年10月前的版本）</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/f364e47d4cdcab7796144a5b39a53f85.png" alt="image-20240317095835831" /></p>
<p>没有任何校验、加密等等，但是之后就变得复杂得多了（严重怀疑微软借鉴了glibc的内存管理）</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/170fbb2877774bded875232a3a8c3128.png" alt="image-20240317100321871" /></p>
<ul>
<li>新版本的池设计管理和R3下是同一个库</li>
<li><strong>每一个独立的池由<code>SEGMENT_HEAP</code>结构体管理</strong>，后文简写为<code>SEG_HEAP</code></li>
<li>池的申请根据其大小进行不同的处理
<ul>
<li>不同大小申请机制不同</li>
<li>大内存池仍然由<code>VA</code>管理</li>
</ul>
</li>
</ul>
<p><strong>SEGMENT_HEAP</strong></p>
<pre><code class="language-cpp">kd&gt; dt nt!_SEGMENT_HEAP
   +0x000 EnvHandle        : RTL_HP_ENV_HANDLE
   +0x010 Signature        : Uint4B
   +0x014 GlobalFlags      : Uint4B
   +0x018 Interceptor      : Uint4B
   +0x01c ProcessHeapListIndex : Uint2B
   +0x01e AllocatedFromMetadata : Pos 0, 1 Bit
   +0x020 CommitLimitData  : _RTL_HEAP_MEMORY_LIMIT_DATA
   +0x020 ReservedMustBeZero1 : Uint8B
   +0x028 UserContext      : Ptr64 Void
   +0x030 ReservedMustBeZero2 : Uint8B
   +0x038 Spare            : Ptr64 Void
   +0x040 LargeMetadataLock : Uint8B
   +0x048 LargeAllocMetadata : _RTL_RB_TREE
   +0x058 LargeReservedPages : Uint8B
   +0x060 LargeCommittedPages : Uint8B
   +0x068 StackTraceInitVar : _RTL_RUN_ONCE
   +0x080 MemStats         : _HEAP_RUNTIME_MEMORY_STATS
   +0x0d8 GlobalLockCount  : Uint2B
   +0x0dc GlobalLockOwner  : Uint4B
   +0x0e0 ContextExtendLock : Uint8B
   +0x0e8 AllocatedBase    : Ptr64 UChar
   +0x0f0 UncommittedBase  : Ptr64 UChar
   +0x0f8 ReservedLimit    : Ptr64 UChar
   +0x100 SegContexts      : [2] _HEAP_SEG_CONTEXT
   +0x280 VsContext        : _HEAP_VS_CONTEXT
   +0x340 LfhContext       : _HEAP_LFH_CONTEXT
</code></pre>
<p>文章选了一些重点来</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/ed29af21efa3768777ad12bffd6c222e.png" alt="image-20240317101151659" /></p>
<p>根据上图缩略结构体</p>
<pre><code class="language-cpp">kd&gt; dt nt!_SEGMENT_HEAP
  ....
   +0x048 LargeAllocMetadata : _RTL_RB_TREE
  ....
   +0x080 MemStats         : _HEAP_RUNTIME_MEMORY_STATS	//大内存页状态
  ....
   +0x0e8 AllocatedBase    : Ptr64 UChar			//已分配内存
   +0x0f0 UncommittedBase  : Ptr64 UChar			//未提交内存
   +0x0f8 ReservedLimit    : Ptr64 UChar			
   +0x100 SegContexts      : [2] _HEAP_SEG_CONTEXT
   +0x280 VsContext        : _HEAP_VS_CONTEXT		//VS类型堆管理链表
   +0x340 LfhContext       : _HEAP_LFH_CONTEXT		//KLFH类型堆管理链表
</code></pre>
<p>根据文章，<code>SEG_HEAP</code>通过两个<code>SegContexts</code>来处理前两种大小的内存（小堆和中堆）</p>
<ul>
<li>0~508KB（0-0x7F000）</li>
<li>508KB~8128KB（0x7F000-0x7F0000）</li>
<li>大于8128KB（大堆处理）</li>
</ul>
<p>内核通过位图（bitmap，做过算法的应该知道吧）保存每次申请的大小的类型</p>
<pre><code class="language-cpp">nt!ExPoolState‐&gt;HeapManager‐&gt;AllocTracker‐&gt;AllocTrackerBitma
</code></pre>
<p>关于位图</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/d5acbdc61a3cace2b43c3a2f3b0e104e.png" alt="image-20240317102907777" /></p>
<ul>
<li>每两字节（2Byte）表示在内核内存中的地址</li>
<li>位图存在三层</li>
</ul>
<p><code>_HEAP_SEG_CONTEXT</code>结构体：</p>
<p>在<code>SEG_HEAP</code>中</p>
<ul>
<li><code>_HEAP_SEG_CONTEXT[0]</code>：以 1 页的基本单位处理 1MB 段</li>
<li><code>_HEAP_SEG_CONTEXT[1]</code>：以 16 页的基本单位处理 16MB 段</li>
</ul>
<pre><code class="language-cpp">1: kd&gt; dt nt!_HEAP_SEG_CONTEXT
   +0x000 SegmentMask      : Uint8B
   +0x008 UnitShift        : UChar
   +0x009 PagesPerUnitShift : UChar
   +0x00a FirstDescriptorIndex : UChar
   +0x00b CachedCommitSoftShift : UChar
   +0x00c CachedCommitHighShift : UChar
   +0x00d Flags            : &lt;anonymous-tag&gt;
   +0x010 MaxAllocationSize : Uint4B
   +0x014 OlpStatsOffset   : Int2B
   +0x016 MemStatsOffset   : Int2B
   +0x018 LfhContext       : Ptr64 Void
   +0x020 VsContext        : Ptr64 Void
   +0x028 EnvHandle        : RTL_HP_ENV_HANDLE
   +0x038 Heap             : Ptr64 Void
   +0x040 SegmentLock      : Uint8B
   +0x048 SegmentListHead  : _LIST_ENTRY
   +0x058 SegmentCount     : Uint8B
   +0x060 FreePageRanges   : _RTL_RB_TREE
   +0x070 FreeSegmentListLock : Uint8B
   +0x078 FreeSegmentList  : [2] _SINGLE_LIST_ENTRY
</code></pre>
<p>简化一下重要信息</p>
<pre><code class="language-cpp">1: kd&gt; dt nt!_HEAP_SEG_CONTEXT
   +0x000 SegmentMask      : Uint8B			//如何从池内存到当前段
.....
   +0x048 SegmentListHead  : _LIST_ENTRY	//连接所有已分配的堆
.....
   +0x078 FreeSegmentList  : [2] _SINGLE_LIST_ENTRY	//链接所有已释放的堆
</code></pre>
<p>段(segment)链接的结构体为`HEAP_PAGE_SEGMENT</p>
<p><code>_HEAP_PAGE_SEGMENT</code>结构体</p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_PAGE_SEGMENT
   +0x000 ListEntry        : _LIST_ENTRY
   +0x010 Signature        : Uint8B
   +0x018 SegmentCommitState : Ptr64 _HEAP_SEGMENT_MGR_COMMIT_STATE
   +0x020 UnusedWatermark  : UChar
   +0x000 DescArray        : [256] _HEAP_PAGE_RANGE_DESCRIPTOR
</code></pre>
<p>这里抹除类型，给点注释</p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_PAGE_SEGMENT
   +0x000 ListEntry        :       //结构体`SEG_CONTECT`指向，可参考下面的图
   +0x010 Signature        :       //可以找到`SEG_CONTEXT`，但是被异或加密了
			//解密方法 `段地址 ^ 堆密钥(heap key) ^ 魔数`
........
   +0x000 DescArray        : [256] //每个保存一个单元，还有子段(subseg)类型和偏移
   //  +0x000 TreeNode         : _RTL_BALANCED_NODE
   //  +0x000 TreeSignature    : Uint4B
   //  +0x004 UnusedBytes      : Uint4B
   //  +0x008 ExtraPresent     : Pos 0, 1 Bit
   //  +0x008 Spare0           : Pos 1, 15 Bits
   //  +0x018 RangeFlags       : UChar
   //  +0x019 CommittedPageCount : UChar
   //  +0x01a Spare            : Uint2B
   //  +0x01c Key              : _HEAP_DESCRIPTOR_KEY
   //  +0x01c Align            : [3] UChar
   //  +0x01f UnitOffset       : UChar
   //  +0x01f UnitSize         : UChar
</code></pre>
<p>总结下当前的内核相关信息，从<code>SEG_HEAP</code>开始</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/271ff260bccb87ea153b8e49dc8db2bd.png" alt="image-20240317103818286" /></p>
<h1>关于两种大小的内存管理</h1>
<h2>两种子段 VS和LFH</h2>
<p><strong>1. LFH - Low Fragmentation Heap</strong></p>
<p><code>_HEAP_LFH_SUBSEGMENT</code></p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_LFH_SUBSEGMENT
   +0x000 ListEntry        : _LIST_ENTRY
   +0x010 Owner            : Ptr64 _HEAP_LFH_SUBSEGMENT_OWNER
   +0x010 DelayFree        : _HEAP_LFH_SUBSEGMENT_DELAY_FREE
   +0x018 CommitLock       : Uint8B
   +0x020 FreeCount        : Uint2B
   +0x022 BlockCount       : Uint2B
   +0x020 InterlockedShort : Int2B
   +0x020 InterlockedLong  : Int4B
   +0x024 FreeHint         : Uint2B
   +0x026 Location         : UChar
   +0x027 WitheldBlockCount : UChar
   +0x028 BlockOffsets     : _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS
   +0x02c CommitUnitShift  : UChar
   +0x02d CommitUnitCount  : UChar
   +0x02e CommitStateOffset : Uint2B
   +0x030 BlockBitmap      : [1] Uint8B
</code></pre>
<ul>
<li>
<p>用于 129 种常见大小的分配</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/e6e613b9c73ef4cfdf6469218064d5db.png" alt="image-20240317112023052" /></p>
</li>
<li>
<p>所有分配的子段有一样的大小</p>
</li>
<li>
<p>最大大小是<code>0x4000</code></p>
</li>
<li>
<p>为了节省空间，没有独特的head</p>
</li>
<li>
<p>堆块的状态由head中的位图决定</p>
</li>
</ul>
<p><strong>2. VS - Variable Size</strong></p>
<p><code>_HEAP_VS_SUBSEGMENT</code></p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_VS_SUBSEGMENT
   +0x000 ListEntry        : _LIST_ENTRY
   +0x010 CommitBitmap     : Uint8B
   +0x018 CommitLock       : Uint8B
   +0x020 Size             : Uint2B
   +0x022 Signature        : Pos 0, 15 Bits
   +0x022 FullCommit       : Pos 15, 1 Bit
</code></pre>
<ul>
<li>处理所有LFH不能处理的bucket</li>
<li>没有个块(block)都有一个自己的头描述</li>
</ul>
<p>两者的对比</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/47b7aed371bc8f6e9464a64b014f0ec9.png" alt="image-20240317110710922" /></p>
<ul>
<li>VS头中的大小使用<code>heap key</code>加密（其实是编码，这里为了语义通顺），LFH使用自己的<code>LFH Key</code> 加密。（这显然让堆利用变得困难，你猜为啥我要反过来读这篇文章而不是直接做HEVD）</li>
<li>子段大小不固定</li>
<li>子段包含多个页，必须从头开始计算偏移去寻找（单独寻找某个页已经几乎不可能）</li>
<li>已分配的块仍然会存在<code>POOL_HEAD</code>，但是释放掉的不会</li>
</ul>
<p><strong>相关的“加密&quot;</strong></p>
<ul>
<li>HEAP_LFH_SUBSEGMENT
<ol>
<li>块大小和偏移量位于编码的 BlockOffsets 字段中</li>
<li>数据（Data） = <code> EncodedData ^ LfhKey ^ ((ULONG)(Subsegment) &gt;&gt; 12)</code></li>
<li>子段列表没被加密</li>
</ol>
</li>
<li>HEAP_VS_SUBSEGMENT
<ol>
<li>用于链接子段的列表被当前子段地址加密了</li>
</ol>
</li>
<li>HEAP_VS_CHUNK_HEADER
<ol>
<li>每一个VS子段中头存在</li>
<li>块大小和分配状态在<code>Size</code>头中被加密</li>
<li>数据（Data）= <code>Sizes.HeaderBits ^ HeapKey ^ ChunkHeader</code></li>
</ol>
</li>
</ul>
<h2>两种上下文</h2>
<p>最开始的<code>SEG_HEAP</code>中有</p>
<pre><code class="language-cpp">   +0x280 VsContext        : _HEAP_VS_CONTEXT
   +0x340 LfhContext       : _HEAP_LFH_CONTEXT
</code></pre>
<p><strong>_HEAP_LFH_CONTEXT</strong></p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_LFH_CONTEXT
   +0x000 BackendCtx       : Ptr64 Void
   +0x008 Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS
   +0x030 AffinityModArray : Ptr64 UChar
   +0x038 MaxAffinity      : UChar
   +0x039 LockType         : UChar
   +0x03a MemStatsOffset   : Int2B
   +0x03c Config           : _RTL_HP_LFH_CONFIG
   +0x040 BucketStats      : _HEAP_LFH_SUBSEGMENT_STATS
   +0x048 SubsegmentCreationLock : Uint8B
   +0x080 Buckets          : [129] Ptr64 _HEAP_LFH_BUCKET
</code></pre>
<p>注释关键信息</p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_LFH_CONTEXT
...
   +0x008 Callbacks        : //子堆分配回调函数
......
   +0x080 Buckets          : [129] //前面提到过LFH处理常见129种堆
								//这里的bucket就存放每个堆的列表
								//保存有关块大小、子段计数、块计数的数据
</code></pre>
<p><strong>_HEAP_VS_CONTEXT</strong></p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_VS_CONTEXT
   +0x000 Lock             : Uint8B
   +0x008 LockType         : _RTLP_HP_LOCK_TYPE
   +0x010 FreeChunkTree    : _RTL_RB_TREE
   +0x020 SubsegmentList   : _LIST_ENTRY
   +0x030 TotalCommittedUnits : Uint8B
   +0x038 FreeCommittedUnits : Uint8B
   +0x040 DelayFreeContext : _HEAP_VS_DELAY_FREE_CONTEXT
   +0x080 BackendCtx       : Ptr64 Void
   +0x088 Callbacks        : _HEAP_SUBALLOCATOR_CALLBACKS
   +0x0b0 Config           : _RTL_HP_VS_CONFIG
   +0x0b4 Flags            : Uint4B
</code></pre>
<p>注释关键信息</p>
<pre><code class="language-cpp">0: kd&gt; dt nt!_HEAP_VS_CONTEXT
......
   +0x020 SubsegmentList   : //所有VS类型的子段
   +0x030 TotalCommittedUnits : //计数
   +0x038 FreeCommittedUnits : //计数
......
   +0x088 Callbacks        : //allocate, free, commit等子段回调函数
......
</code></pre>
<p>总结下两种上下文</p>
<p><img src="https://img-1300594400.cos.ap-shanghai.myqcloud.com/uploads/big/09b816568e627599cec85957350f2d0c.png" alt="image-20240317112721755" /></p>

</div>
</div></body>